[
  {
    "name": "Braveheart",
    "id": "tt0112573",
    "image": "http://ia.media-imdb.com/images/M/MV5BNjA4ODYxMDU3Nl5BMl5BanBnXkFtZTcwMzkzMTk3OA@@._V1_SX214_AL_.jpg",
    "score": 8.399999618530273,
    "duration": "177 min",
    "launchDate": "24 May 1995 (USA)",
    "genres": {
      "genre": [
        "Action",
        "Biography",
        "Drama"
      ]
    },
    "directors": {
      "director": [
        "nm0000154"
      ]
    },
    "studios": {
      "studio": [
        "co0000700",
        "co0042559",
        "co0078539"
      ]
    },
    "stars": {
      "star": [
        "nm0000154",
        "nm0000521",
        "nm0001526"
      ]
    },
    "description": "William Wallace is a Scottish rebel who leads an uprising against the cruel English ruler Edward the Longshanks, who wishes to inherit the crown of Scotland for himself. When he was a young boy, William Wallace\u0027s father and brother, along with many others, lost their lives trying to free Scotland. Once he loses another of his loved ones, William Wallace begins his long quest to make Scotland free once and for all, along with the assistance of Robert the Bruce. Written by Anonymous"
  },
  {
    "name": "The Usual Suspects",
    "id": "tt0114814",
    "image": "http://ia.media-imdb.com/images/M/MV5BMzI1MjI5MDQyOV5BMl5BanBnXkFtZTcwNzE4Mjg3NA@@._V1_SX214_AL_.jpg",
    "score": 8.699999809265137,
    "duration": "106 min",
    "launchDate": "15 September 1995 (USA)",
    "genres": {
      "genre": [
        "Crime",
        "Drama",
        "Thriller"
      ]
    },
    "directors": {
      "director": [
        "nm0001741"
      ]
    },
    "studios": {
      "studio": [
        "co0106129",
        "co0033402",
        "co0082030"
      ]
    },
    "stars": {
      "star": [
        "nm0000228",
        "nm0000321",
        "nm0001590"
      ]
    },
    "description": "Following a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them is guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze? Written by Soumitra"
  },
  {
    "name": "Se7en",
    "id": "tt0114369",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTQwNTU3MTE4NF5BMl5BanBnXkFtZTcwOTgxNDM2Mg@@._V1_SX214_AL_.jpg",
    "score": 8.699999809265137,
    "duration": "127 min",
    "launchDate": "22 September 1995 (USA)",
    "genres": {
      "genre": [
        "Drama",
        "Mystery",
        "Thriller"
      ]
    },
    "directors": {
      "director": [
        "nm0000399"
      ]
    },
    "studios": {
      "studio": [
        "co0078943",
        "co0046718"
      ]
    },
    "stars": {
      "star": [
        "nm0000151",
        "nm0000093",
        "nm0000228"
      ]
    },
    "description": "A film about two homicide detectives\u0027 desperate hunt for a serial killer who justifies his crimes as absolution for the world\u0027s ignorance of the Seven Deadly Sins. The movie takes us from the tortured remains of one victim to the next as the sociopathic \"John Doe\" sermonizes to Detectives Sommerset and Mills -- one sin at a time. The sin of Gluttony comes first and the murderer\u0027s terrible capacity is graphically demonstrated in the dark and subdued tones characteristic of film noir. The seasoned and cultured but jaded Sommerset researches the Seven Deadly Sins in an effort to understand the killer\u0027s modus operandi while the bright but green and impulsive Detective Mills scoffs at his efforts to get inside the mind of a killer... Written by Mark Fleetwood \u003cmfleetwo@mail.coin.missouri.edu\u003e"
  },
  {
    "name": "Heat",
    "id": "tt0113277",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTM1NDc4ODkxNV5BMl5BanBnXkFtZTcwNTI4ODE3MQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
    "score": 8.300000190734863,
    "duration": "170 min",
    "launchDate": "15 December 1995 (USA)",
    "genres": {
      "genre": [
        "Action",
        "Crime",
        "Drama"
      ]
    },
    "directors": {
      "director": [
        "nm0000520"
      ]
    },
    "studios": {
      "studio": [
        "co0026840",
        "co0021592",
        "co0035930"
      ]
    },
    "stars": {
      "star": [
        "nm0000199",
        "nm0000134",
        "nm0000174"
      ]
    },
    "description": "Hunters and their prey--Neil and his professional criminal crew hunt to score big money targets (banks, vaults, armored cars) and are, in turn, hunted by Lt. Vincent Hanna and his team of cops in the Robbery/Homicide police division. A botched job puts Hanna onto their trail while they regroup and try to put together one last big \u0027retirement\u0027 score. Neil and Vincent are similar in many ways, including their troubled personal lives. At a crucial moment in his life, Neil disobeys the dictum taught to him long ago by his criminal mentor--\u0027Never have anything in your life that you can\u0027t walk out on in thirty seconds flat, if you spot the heat coming around the corner\u0027--as he falls in love. Thus the stage is set for the suspenseful ending.... Written by Tad Dibbern \u003cDIBBERN_D@a1.mscf.upenn.edu\u003e"
  },
  {
    "name": "Toy Story",
    "id": "tt0114709",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTgwMjI4MzU5N15BMl5BanBnXkFtZTcwMTMyNTk3OA@@._V1_SY317_CR12,0,214,317_AL_.jpg",
    "score": 8.300000190734863,
    "duration": "81 min",
    "launchDate": "22 November 1995 (USA)",
    "genres": {
      "genre": [
        "Animation",
        "Adventure",
        "Comedy"
      ]
    },
    "directors": {
      "director": [
        "nm0005124"
      ]
    },
    "studios": {
      "studio": [
        "co0017902",
        "co0008970"
      ]
    },
    "stars": {
      "star": [
        "nm0000158",
        "nm0000741",
        "nm0725543"
      ]
    },
    "description": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy\u0027s family moving, and what Woody does not know is about Andy\u0027s birthday party. Woody does not realize that Andy\u0027s mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy\u0027s new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips. Written by John Wiggins"
  },
  {
    "name": "Clueless",
    "id": "tt0112697",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTgxODIxODE2MF5BMl5BanBnXkFtZTgwOTA4NjQxMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
    "score": 6.699999809265137,
    "duration": "97 min",
    "launchDate": "19 July 1995 (USA)",
    "genres": {
      "genre": [
        "Comedy",
        "Romance"
      ]
    },
    "directors": {
      "director": [
        "nm0002132"
      ]
    },
    "studios": {
      "studio": [
        "co0023400"
      ]
    },
    "stars": {
      "star": [
        "nm0000224",
        "nm0001107",
        "nm0005261"
      ]
    },
    "description": "Cher, a high school student in Beverly Hills, must survive the ups and downs of adolescent life. Her external demeanor at first seems superficial, but rather it hides her wit, charm, and intelligence which help her to deal with relationships, friends, family, school, and the all-important teenage social life. Written by Michael Kaminsky \u003ckaminsky@ucsee.eecs.berkeley.edu\u003e"
  },
  {
    "name": "Batman Forever",
    "id": "tt0112462",
    "image": "http://ia.media-imdb.com/images/M/MV5BMjAwOTEyNjg0M15BMl5BanBnXkFtZTYwODQyMTI5._V1_SY317_CR10,0,214,317_AL_.jpg",
    "score": 5.400000095367432,
    "duration": "121 min",
    "launchDate": "16 June 1995 (USA)",
    "genres": {
      "genre": [
        "Action",
        "Adventure",
        "Fantasy"
      ]
    },
    "directors": {
      "director": [
        "nm0001708"
      ]
    },
    "studios": {
      "studio": [
        "co0026840",
        "co0106129"
      ]
    },
    "stars": {
      "star": [
        "nm0000174",
        "nm0000169",
        "nm0000120"
      ]
    },
    "description": "The Dark Knight of Gotham City confronts a dastardly duo: Two-Face and the Riddler. Formerly District Attorney Harvey Dent, Two-Face incorrectly believes Batman caused the courtroom accident which left him disfigured on one side; he has unleashed a reign of terror on the good people of Gotham. Edward Nygma, computer-genius and former employee of millionaire Bruce Wayne, is out to get the philanthropist; as The Riddler he perfects a device for draining information from all the brains in Gotham, including Bruce Wayne\u0027s knowledge of his other identity. Batman/Wayne is/are the love focus of Dr. Chase Meridan. Former circus acrobat Dick Grayson, his family killed by Two-Face, becomes Wayne\u0027s ward and Batman\u0027s new partner Robin the Boy Wonder. Written by Ed Stephan \u003cstephan@cc.wwu.edu\u003e"
  },
  {
    "name": "Twelve Monkeys",
    "id": "tt0114746",
    "image": "http://ia.media-imdb.com/images/M/MV5BMjI4MDIxNjk2Ml5BMl5BanBnXkFtZTcwMTA3Njk3OA@@._V1_SY317_CR12,0,214,317_AL_.jpg",
    "score": 8.100000381469727,
    "duration": "129 min",
    "launchDate": "5 January 1996 (USA)",
    "genres": {
      "genre": [
        "Mystery",
        "Sci-Fi",
        "Thriller"
      ]
    },
    "directors": {
      "director": [
        "nm0000416"
      ]
    },
    "studios": {
      "studio": [
        "co0005073",
        "co0028338",
        "co0036534"
      ]
    },
    "stars": {
      "star": [
        "nm0000246",
        "nm0000656",
        "nm0000093"
      ]
    },
    "description": "An unknown and lethal virus has wiped out five billion people in 1996. Only 1% of the population has survived by the year 2035, and is forced to live underground. A convict (James Cole) reluctantly volunteers to be sent back in time to 1996 to gather information about the origin of the epidemic (who he\u0027s told was spread by a mysterious \"Army of the Twelve Monkeys\") and locate the virus before it mutates so that scientists can study it. Unfortunately Cole is mistakenly sent to 1990, six years earlier than expected, and is arrested and locked up in a mental institution, where he meets Dr. Kathryn Railly, a psychiatrist, and Jeffrey Goines, the insane son of a famous scientist and virus expert. Written by Giancarlo Cairella \u003cvertigo@imdb.com\u003e"
  },
  {
    "name": "Friday",
    "id": "tt0113118",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTQ1NzE3MzY0NV5BMl5BanBnXkFtZTYwNTM2MzE5._V1_SY317_CR6,0,214,317_AL_.jpg",
    "score": 7.300000190734863,
    "duration": "91 min",
    "launchDate": "26 April 1995 (USA)",
    "genres": {
      "genre": [
        "Comedy",
        "Drama"
      ]
    },
    "directors": {
      "director": [
        "nm0336620"
      ]
    },
    "studios": {
      "studio": [
        "co0046718",
        "co0150372"
      ]
    },
    "stars": {
      "star": [
        "nm0001084",
        "nm0000676",
        "nm0000505"
      ]
    },
    "description": "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do. Encounters with neighbors and other friends over the course of the day and night, and their ensuing antics, make up the rest of the movie. Written by Anonymous"
  },
  {
    "name": "GoldenEye",
    "id": "tt0113189",
    "image": "http://ia.media-imdb.com/images/M/MV5BMzk2OTg4MTk1NF5BMl5BanBnXkFtZTcwNjExNTgzNA@@._V1_SX214_AL_.jpg",
    "score": 7.199999809265137,
    "duration": "130 min",
    "launchDate": "17 November 1995 (USA)",
    "genres": {
      "genre": [
        "Action",
        "Adventure",
        "Thriller"
      ]
    },
    "directors": {
      "director": [
        "nm0132709"
      ]
    },
    "studios": {
      "studio": [
        "co0054040",
        "co0026841"
      ]
    },
    "stars": {
      "star": [
        "nm0000112",
        "nm0000293",
        "nm0001713"
      ]
    },
    "description": "When a deadly satellite weapon system falls into the wrong hands, only Agent 007 can save the world from certain disaster. Armed with his license to kill, Bond races to Russia in search of the stolen access codes for \"Goldeneye,\" an awesome space weapon that can fire a devastating electromagnetic pulse toward Earth. But 007 is up against an enemy who anticipates his every move: a mastermind motivated by years of simmering hatred. Bond also squares off against Xenia Onatopp, an assassin who uses pleasure as her ultimate weapon. Written by Robert Lynch \u003cdocrlynch@yahoo.com\u003e"
  }
]