[
  {
    "name": "Jingle All the Way",
    "id": "tt0116705",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTE5OTYzMzc0MV5BMl5BanBnXkFtZTcwNjQ0NTI1MQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
    "score": 5.4,
    "duration": "89",
    "launchDate": "1996-11-22",
    "genres": {
      "genre": [
        "Comedy",
        "Family"
      ]
    },
    "directors": {
      "director": [
        "nm0505152"
      ]
    },
    "studios": {
      "studio": [
        "co0046151",
        "co0000756"
      ]
    },
    "stars": {
      "star": [
        "nm0000216",
        "nm0005435",
        "nm0367005"
      ]
    },
    "description": "Meet Howard Langston, a salesman for a mattress company is constantly busy at his job, and he also constantly disappoints his son, after he misses his son\u0027s karate exposition, he tries hard to come up with a way to make it up to him, this is when his son tells Howard that he wants for Christmas is an action figure of his son\u0027s television hero, Turbo Man. Unfotunately for Howard, it is Christmas Eve, and every store is sold out of Turbo Man figures, now Howard must travel all over town and compete with everybody else including a mail man named Myron to find a Turbo Man action figure, and to make it to the Wintertainment parade which will feature Turbo Man. Written by John Wiggins"
  },
  {
    "name": "Independence Day",
    "id": "tt0116629",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTMwODY3NzQzNF5BMl5BanBnXkFtZTcwNzUxNjc0MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
    "score": 6.9,
    "duration": "145",
    "launchDate": "1996-7-3",
    "genres": {
      "genre": [
        "Action",
        "Adventure",
        "Sci-Fi"
      ]
    },
    "directors": {
      "director": [
        "nm0000386"
      ]
    },
    "studios": {
      "studio": [
        "co0000756",
        "co0050111"
      ]
    },
    "stars": {
      "star": [
        "nm0000226",
        "nm0000597",
        "nm0000156"
      ]
    },
    "description": "On July 2nd, communications systems worldwide are sent into chaos by a strange atmospheric interference. It is soon learned by the military that a number of enormous objects are on a collision course with Earth. At first thought to be meteors, they are later revealed to be gigantic spacecraft, piloted by a mysterious alien species. After attempts to communicate with the aliens go nowhere, David Levinson, an ex-scientist turned cable technician, discovers that the aliens are going to attack major points around the globe in less than a day. On July 3rd, the aliens all but obliterate New York, Los Angeles, and Washington, as well as Paris, London, Houston and Moscow. The survivors set out in convoys towards Area 51, a strange government testing ground where it is rumored the military has a captured alien spacecraft of their own. The survivors devise a plan to fight back against the enslaving aliens, and July 4th becomes the day humanity will fight for its freedom. July 4th is their ... Written by Gustaf Molin \u003cgumo@hem2.passagen.se\u003e"
  },
  {
    "name": "Fargo",
    "id": "tt0116282",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTgxNzY3MzUxOV5BMl5BanBnXkFtZTcwMDA0NjMyNA@@._V1_SX214_AL_.jpg",
    "score": 8.1,
    "duration": "98",
    "launchDate": "1996-4-5",
    "genres": {
      "genre": [
        "Crime",
        "Drama",
        "Thriller"
      ]
    },
    "directors": {
      "director": [
        "nm0001054",
        "nm0001053"
      ]
    },
    "studios": {
      "studio": [
        "co0106129",
        "co0057311"
      ]
    },
    "stars": {
      "star": [
        "nm0000513",
        "nm0000531",
        "nm0000114"
      ]
    },
    "description": "Jerry works in his father-in-law\u0027s car dealership and has gotten himself in financial problems. He tries various schemes to come up with money needed for a reason that is never really explained. It has to be assumed that his huge embezzlement of money from the dealership is about to be discovered by father-in-law. When all else falls through, plans he set in motion earlier for two men to kidnap his wife for ransom to be paid by her wealthy father (who doesn\u0027t seem to have the time of day for son-in-law). From the moment of the kidnapping, things go wrong and what was supposed to be a non-violent affair turns bloody with more blood added by the minute. Jerry is upset at the bloodshed, which turns loose a pregnant sheriff from Brainerd, MN who is tenacious in attempting to solve the three murders in her jurisdiction. Written by Anonymous"
  },
  {
    "name": "Romeo + Juliet",
    "id": "tt0117509",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTI2ODc3NDI4OV5BMl5BanBnXkFtZTYwMTY1MjQ5._V1._CR1,1,341,448_SY317_CR13,0,214,317_AL_.jpg",
    "score": 6.9,
    "duration": "120",
    "launchDate": "1996-11-1",
    "genres": {
      "genre": [
        "Drama",
        "Romance"
      ]
    },
    "directors": {
      "director": [
        "nm0525303"
      ]
    },
    "studios": {
      "studio": [
        "co0062619",
        "co0000756"
      ]
    },
    "stars": {
      "star": [
        "nm0000138",
        "nm0000132",
        "nm0000491"
      ]
    },
    "description": "Shakespeare\u0027s famous play is updated to the hip modern suburb of Verona still retaining its original dialogue. The gun-toting members of the families wage a vicious war on the streets as the star-crossed lovers meet their tragic destiny. Written by Alexander Lum \u003caj_lum@postoffice.utas.edu.au\u003e"
  },
  {
    "name": "Matilda",
    "id": "tt0117008",
    "image": "http://ia.media-imdb.com/images/M/MV5BNTYxNDEyMDQ1MF5BMl5BanBnXkFtZTcwODcxMDYyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
    "score": 6.8,
    "duration": "102",
    "launchDate": "1996-8-2",
    "genres": {
      "genre": [
        "Comedy",
        "Fantasy"
      ]
    },
    "directors": {
      "director": [
        "nm0000362"
      ]
    },
    "studios": {
      "studio": [
        "co0005883",
        "co0010434"
      ]
    },
    "stars": {
      "star": [
        "nm0000362",
        "nm0674231",
        "nm0933798"
      ]
    },
    "description": "A grouchy couple are parents to a very sweet girl, Matilda. Unlike her bratty brother and mean parents, Matilda becomes a very sweet and extremely intelligent 6 year old girl, who is very keen to go to school and read books. After a while, her parents send her to school with the worst principal in the world, a very sweet teacher, and good friends. While trying to put up with her parents\u0027 and principal\u0027s cruelty, she starts to unwittingly unleash telekinetic powers, destroying a television and making a newt fly onto the principal. With enough practice, Matilda starts to learn to control her telekinetic powers and soon using them on her principal so she can drive her away from the school. Written by anonomys"
  },
  {
    "name": "That Thing You Do!",
    "id": "tt0117887",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTczMzM2MTM0NF5BMl5BanBnXkFtZTcwMTIwMDQ0MQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
    "score": 6.8,
    "duration": "108",
    "launchDate": "1996-10-4",
    "genres": {
      "genre": [
        "Comedy",
        "Drama",
        "Music"
      ]
    },
    "directors": {
      "director": [
        "nm0000158"
      ]
    },
    "studios": {
      "studio": [
        "co0005677",
        "co0093046",
        "co0000756"
      ]
    },
    "stars": {
      "star": [
        "nm0000158",
        "nm0000239",
        "nm0000234"
      ]
    },
    "description": "Recounts a fable of a pop rock band formed a year after the Beatles took America by storm in early 1964. Jazz aficionado Guy Patterson, unhappily toiling in the family appliance store, is recruited into the band the Oneders (later renamed the Wonders) after regular drummer Chad breaks his arm. After Guy injects a four/four rock beat into lead singer Jimmy\u0027s ballad, the song\u0027s undeniable pop power flings the Wonders into a brief whirlwind of success, telling the tale of many American bands who attempted to grab the brass ring of rock and roll in the wake of the British Invasion. Written by Rick Gregory \u003crag.apa@email.apa.org\u003e"
  },
  {
    "name": "Trainspotting",
    "id": "tt0117951",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTg2MzcxNTY3NV5BMl5BanBnXkFtZTgwOTQ5NDQxMDE@._V1_SX214_AL_.jpg",
    "score": 8.1,
    "duration": "94",
    "launchDate": "1996-7-19",
    "genres": {
      "genre": [
        "Drama"
      ]
    },
    "directors": {
      "director": [
        "nm0000965"
      ]
    },
    "studios": {
      "studio": [
        "co0103532",
        "co0103732",
        "co0011025"
      ]
    },
    "stars": {
      "star": [
        "nm0000191",
        "nm0001971",
        "nm0001538"
      ]
    },
    "description": "A wild, freeform, Rabelaisian trip through the darkest recesses of Edinburgh low-life, focusing on Mark Renton and his attempt to give up his heroin habit, and how the latter affects his relationship with family and friends: Sean Connery wannabe Sick Boy, dimbulb Spud, psycho Begbie, 14-year-old girlfriend Diane, and clean-cut athlete Tommy, who\u0027s never touched drugs but can\u0027t help being curious about them... Written by Michael Brooke \u003cmichael@everyman.demon.co.uk\u003e"
  },
  {
    "name": "Happy Gilmore",
    "id": "tt0116483",
    "image": "http://ia.media-imdb.com/images/M/MV5BMjA4NjUxODg3Ml5BMl5BanBnXkFtZTcwNzcyODc5Mw@@._V1_SX214_AL_.jpg",
    "score": 7.0,
    "duration": "92",
    "launchDate": "1996-2-16",
    "genres": {
      "genre": [
        "Comedy",
        "Sport"
      ]
    },
    "directors": {
      "director": [
        "nm0240797"
      ]
    },
    "studios": {
      "studio": [
        "co0005073",
        "co0063786",
        "co0033486"
      ]
    },
    "stars": {
      "star": [
        "nm0001191",
        "nm0001520",
        "nm0100866"
      ]
    },
    "description": "A Hockey player wannabe finds out that he has the most powerful golf drive in history. He joins the P.G.A. tour to make some money to save grandma\u0027s house. The downside is that his hocky player mentality doesn\u0027t really go on the P.G.A. tour. Especially with the favorite to win the championship. Written by Kevin Mitchell \u003ckevin@mitchell.mdn.com\u003e"
  },
  {
    "name": "101 Dalmatians",
    "id": "tt0115433",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTkxNjQwMjM4OF5BMl5BanBnXkFtZTcwMTU5NDMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
    "score": 5.5,
    "duration": "103",
    "launchDate": "1996-11-27",
    "genres": {
      "genre": [
        "Adventure",
        "Comedy"
      ]
    },
    "directors": {
      "director": [
        "nm0378893"
      ]
    },
    "studios": {
      "studio": [
        "co0008970",
        "co0111235",
        "co0008682"
      ]
    },
    "stars": {
      "star": [
        "nm0000335",
        "nm0001099",
        "nm0000613"
      ]
    },
    "description": "Fashion designer Anita and computer-game writer Roger meet, fall in love and marry along with their dalmatians Perdita and Pongo. But the proud dogs\u0027 puppies are kidnapped by Anita\u0027s boss Cruella De Vil, who is stealing young dalmatians to make the coat she has set her heart on. Enlisting the help of the British animal kingdom, Pongo and Perdita set out to find and rescue all ninety-nine pups from their fearsome captors, Jasper and Horace. Written by Jeremy Perkins {J-26}"
  },
  {
    "name": "Mission: Impossible",
    "id": "tt0117060",
    "image": "http://ia.media-imdb.com/images/M/MV5BMTc3NjI2MjU0Nl5BMl5BanBnXkFtZTgwNDk3ODYxMTE@._V1_SX214_AL_.jpg",
    "score": 7.0,
    "duration": "110",
    "launchDate": "1996-5-22",
    "genres": {
      "genre": [
        "Action",
        "Adventure",
        "Thriller"
      ]
    },
    "directors": {
      "director": [
        "nm0000361"
      ]
    },
    "studios": {
      "studio": [
        "co0023400",
        "co0012382"
      ]
    },
    "stars": {
      "star": [
        "nm0000129",
        "nm0000685",
        "nm0000322"
      ]
    },
    "description": "Based on the hit T.V. series. Jim Phelps was sent to Prague for a mission to prevent the theft of classified material. His wife Claire and his trusted partner Ethan Hunt were members of Phelps\u0027 team. Unfortunately, something went horribly wrong and the mission failed, leaving Ethan Hunt the lone survivor. After he reported the failed mission, Kettridge the head if the agency suspects Ethan of being the culprit for the failed mission. Now, Ethan uses unorthodox methods (Which includes the aid of an arms dealer going by the name \"Max\") to try to find who set him up and to clear his name. Written by John Wiggins"
  }
]