[
  {
    "name": "Robert Zemeckis",
    "birthDate": "1951-05-14T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTgyMTMzMDUyNl5BMl5BanBnXkFtZTcwODA0ODMyMw@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000709",
    "miniBio": "A whiz-kid with special effects, Robert is from the Spielberg camp of film-making (Steven Spielberg produced many of his films). Usually working with writing partner Bob Gale, Robert\u0027s earlier films show he has a talent for zany comedy (Romancing the Stone (1984), 1941 (1979)) and special effect vehicles (Who Framed Roger Rabbit (1988) and Back to the Future (1985)). His later films have become more serious, with the hugely successful Tom Hanks vehicle Forrest Gump (1994) and the Jodie Foster film Contact (1997), both critically acclaimed movies. Again, these films incorporate stunning effects. Robert has proved he can work a serious story around great effects.",
    "birthPlace": "Chicago, Illinois, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Producer",
      "Writer",
      "Director"
    ],
    "knownFor": [
      "tt0096874",
      "tt0088763",
      "tt0099088",
      "tt0338348"
    ]
  },
  {
    "name": "Joe Roth",
    "birthDate": "1948-06-13T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTgwMDAyNTI0N15BMl5BanBnXkFtZTcwNDY4MDQ4NA@@._V1_SY317_CR16,0,214,317_AL_.jpg",
    "id": "nm0005387",
    "miniBio": "Joe Roth was born on June 13, 1948 in New York City, New York, USA. He is a producer and director, known for Alice in Wonderland (2010), Maleficent (2014) and Snow White and the Huntsman (2012). He is married to Donna Roth.",
    "birthPlace": "New York City, New York, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Producer",
      "Director",
      "Miscellaneous Crew"
    ],
    "knownFor": [
      "tt1014759",
      "tt1587310",
      "tt1735898",
      "tt1623205"
    ]
  },
  {
    "name": "Mark Waters",
    "birthDate": "1964-06-30T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTU3NzQ1NDQ0MV5BMl5BanBnXkFtZTcwMTE2NTU3MQ@@._V1_SY317_CR16,0,214,317_AL_.jpg",
    "id": "nm0914134",
    "miniBio": "Mark Waters was born on June 30, 1964 in Wyandotte, Michigan, USA as Mark Stephen Waters. He is a director and producer, known for Mean Girls (2004), Freaky Friday (2003) and Just Like Heaven (2005). He has been married to Dina Spybey-Waters since November 10, 2000.",
    "birthPlace": "Wyandotte, Michigan, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Director",
      "Producer",
      "Writer"
    ],
    "knownFor": [
      "tt0377092",
      "tt0322330",
      "tt0425123",
      "tt0416236"
    ]
  },
  {
    "name": "Wolfgang Petersen",
    "birthDate": "1941-03-14T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTczNTQ5ODY4OV5BMl5BanBnXkFtZTYwMDcyMDI1._V1_SY317_CR1,0,214,317_AL_.jpg",
    "id": "nm0000583",
    "miniBio": "Wolfgang Petersen was born on March 14, 1941 in Emden, Germany. He is a director and producer, known for Troy (2004), Das Boot (1981) and The NeverEnding Story (1984). He has been married to Maria-Antoinette Borgel since 1978. He was previously married to Ursula Sieg.",
    "birthPlace": "Emden, Germany",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Director",
      "Producer",
      "Writer"
    ],
    "knownFor": [
      "tt0332452",
      "tt0082096",
      "tt0088323",
      "tt0118571"
    ]
  },
  {
    "name": "Trey Parker",
    "birthDate": "1969-10-19T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTk1ODExNDY2Nl5BMl5BanBnXkFtZTYwNDIyMTQ0._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0005295",
    "miniBio": "Trey was born in Conifer, Colorado, on October 19, 1969 to Randy Parker ,a geologist, and Sharon Parker, an insurance broker. He has an older sister, Shelley Parker. He met Matt Stone (co-creator of South Park (1997)) while attending the University of Colorado in Boulder, where he had a double major of music and Japanese. While at UCB he wrote, directed and starred in Cannibal! The Musical (1993) (aka \"Cannibal: The Musical!\") based on a true episode in Colorado\u0027s history. After graduation from UCB (rumors that he didn\u0027t due to skipping classes to work on the movie are false), he and Stone were asked by then-FoxLab executive Brian Graden to create an animated Christmas card for his friends and family. The now infamous short, titled The Spirit of Christmas (1995), led to South Park (1997).",
    "birthPlace": "Conifer, Colorado, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Writer",
      "Producer",
      "Actor"
    ],
    "knownFor": [
      "tt0158983",
      "tt0121955",
      "tt0372588",
      "tt0124819"
    ]
  },
  {
    "name": "Nick Cassavetes",
    "birthDate": "1959-05-21T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTcxNjA2MjI3Nl5BMl5BanBnXkFtZTYwMjkyNjMz._V1_SY317_CR1,0,214,317_AL_.jpg",
    "id": "nm0001024",
    "miniBio": "Nick Cassavetes was born in New York City, the son of actress Gena Rowlands and Greek-American actor and film director John Cassavetes. As a child, he appeared in two of his father\u0027s films: Husbands (1970) and A Woman Under the Influence (1974). After spending so much of his youth surrounded by the film industry, Cassavetes initially decided he did not want to go into the field. He instead attended Syracuse University on a basketball scholarship. His athletic career was effectively ended by an injury, and he decided to rethink his aspirations, ultimately deciding to attend his parents\u0027 alma mater, the American Academy of Dramatic Arts in New York. He has appeared in the films Face/Off, The Wraith, Life, Class of 1999 II: The Substitute, Backstreet Dreams and The Astronaut\u0027s Wife, among others. He has directed several films, including John Q, Alpha Dog, She\u0027s So Lovely, Unhook the Stars, The Notebook, and My Sister\u0027s Keeper. He also adapted the screenplay for Blow and wrote the dialogue for the Justin Timberlake music video \"What Goes Around... Comes Around\". In 1985, Cassavetes married Isabelle Rafalovich. They had two daughters together, Virginia Sara (born 1986) and Sasha (born 1988), before divorcing. He then married Heather \"Queenie\" Wahlquist, who has appeared in several of his films, including a small role in The Notebook as Sara, a secondary character and best friend to the female lead Allie Hamilton, portrayed by Rachel McAdams. The movie is effectively a family project, as Cassavetes\u0027s own mother, Gena Rowlands, appears as the older, married Allie Calhoun.",
    "birthPlace": "New York City, New York, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Actor",
      "Director",
      "Writer"
    ],
    "knownFor": [
      "tt0332280",
      "tt0119094",
      "tt0426883",
      "tt1078588"
    ]
  },
  {
    "name": "Alfonso Cuarón",
    "birthDate": "1961-11-28T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjA0ODY4OTk4Nl5BMl5BanBnXkFtZTcwNTkxMzYyMg@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0190859",
    "miniBio": "Alfonso Cuarón Orozco was born on November 28th in Mexico City, Mexico. From an early age, he yearned to be either a film director or an astronaut. However, he did not want to enter the army, so he settled for directing. He didn\u0027t receive his first camera until his twelfth birthday, and then immediately started to film everything he saw, showing it afterwards to everyone. In his teen years, films were his hobby. Sometimes he said to his mother he would go to a friend\u0027s home, when in fact he would go to the cinema. His ambition was to know every theatre in the city. Near his house there were two studios, Studios Churubusco and Studios 212. After finishing school, Cuarón decided to study cinema right away. He tried to study at C.C.C. (Centro de Capacitación Cinematográfica) but wasn\u0027t accepted because at that time they weren\u0027t accepting students under twenty-four years old. His mother didn\u0027t support that idea of cinema, so he studied philosophy in the morning and in the afternoon he went to the C.U.E.C. (Centro Universitario de Estudios Cinematográficos). During that time he met many people who would later become his collaborators and friends. One of them was Luis Estrada. Cuaron also became good friends with Carlos Marcovich and Emmanuel Lubezki. Luis Estrada directed a short called \"Vengance is Mine\", on which Alfonso and Emmanuel collaborated. The film was in English, a fact which bothered many teachers of the C.U.E.C. such as Marcela Fernández Violante. The disagreement caused such arguments that in 1985, Alfonso was expelled from the university. During his time studying at C.U.E.C. he met Mariana Elizondo, and with her he had his first son, Jonás Cuarón. After Alfonso was expelled, he thought he could never be a director and so went on to work in a Museum so he could sustain his family. One day, José Luis García Agraz and Fernando CáMara went to the museum and made an offer to Cuarón. They asked him to work as cable person in \"La víspera (1982)\", a job which was to prove to be his salvation. After that he was assistant director in Garcia Agraz\u0027s \"Nocaut (1984)\", as well as numerous other films. He was also second unit director in \"Gaby: A True Story (1987)\", and co-wrote and directed some episodes in the series \"A Hora Marcada (1967)\". One New Year\u0027s Eve, he decided he would not continue to be an assistant director, and with his brother Carlos started writing what would be his first feature film: \"Sólo con tu pareja (1991)\" (Love in the time of Hysteria). After the screenplay was written, the problem became how to get financial backing for the movie. I.M.C.I.N.E. (Instituto Mexicano de Cinematografia), which supports movies financially, had already decided which projects it would support that year, much to Alfonso\u0027s initial chagrin. However, the director of one of those already-chosen projects was unable to direct it, so his project was canceled, and \"Sólo con tu pareja\" took its place. Despite this being chosen, there was a lot of tension between Alfonso and the I.M.C.I.N.E. executives. Nevertheless, after the movie was finished, it was a huge success. In Toronto festival the films won many awards, and Alfonso started to be noticed by Hollywood producers. Sydney Pollack was the first one to invite him to shoot in Hollywood. He proposed a feature film to be directed by Alfonso, but the project didn\u0027t work and was canceled. Alfonso moved to Los Angeles without anything concrete, and stayed with some friends, as he had no money. Soon after that, Pollack called him again to direct an episode called \"Fallen Angels: Murder, Obliquely (1993)\" of the series \"Fallen Angels (1993)\", that was the first job he had in U.S., and also the first time he worked with Alan Rickman. After a while, and no real directing jobs, Alfonso wanted to direct something as he needed money. He finally signed a contract with Warner Brothers to direct the film Addicted to Love (1995). However, one night, he read the screenplay for another film, A Little Princess (1995) and fell in love with it. He talked to Warner Brothers and after some meetings he gave up directing \"Addicted to Love\" in order to do \"A Little Princess\". Even thought it wasn\u0027t a great box office success, the film received two nominations for the Oscars, and won many other awards. After \"A Little Princess\" Alfonso developed a project with Richard Gere starring. The project was canceled, but Cuarón got an offer from Twentieth Century Fox to direct the modern adaptation of the Charles Dickens\u0027 classic Great Expectations (1998). He initially didn\u0027t want to direct it but the studio insisted, and in the end he accepted it. The experience was very painful and difficult for him mainly because there was never a definitive screenplay. He then reunited with producer Jorge Vergara and founded both Anhelo Productions and Moonson Productions. Anhelo\u0027s first picture was also Alfonso\u0027s next film, the erotic road movie \"Y Tu Mamá También (2001)\", which was a huge success. During the promotion of the film in Venice, Alfonso met the cinema critic Annalisa Bugliani. They started dating and married that same year. \"Children of Men (2006)\" was to be Alfonso\u0027s next film, a futuristic, dystopian story. During the preproduction of the film, Warner Brothers invited Alfonso to direct the third Harry Potter film, \"Harry Potter and the Prisoner of Azkaban (2004)\", an offer which he accepted after some consideration. The film would prove to be the greatest box office success of his career. In 2003, he had a daughter named Tess Bu Cuarón, and in February 2005 another son, called Olmo Teodoro Cuarón. Alfonso Cuarón signed a three-year first-look deal with Warner Brothers, which allowed his films to be distributed world-wide. As a result of that deal, he developed two new projects, _History of Love, The (2007)_ and _Memory of Running, The (2007)_. He also developed another Mexican film \"_México \u002768 (2007)_\", about the violent students\u0027 revolt that happened in Mexico in 1968. He directed one five-minute segment of the anthology film Paris, je t\u0027aime (2006) with Nick Nolte and Ludivine Sagnier. His next project, the futuristic film Children of Men (2006) with Clive Owen, Julianne Moore and Michael Caine premiered at the Venice Film Festival in 2006 having been nominated for three Academy Awards. After his youngest son was diagnosed with autism and the divorce from Annalisa Bugliani he took a break from directing and settled in London where he plans to work on his next projects. In 2013, Alfonso directed the space thriller Gravity (2013), which would go win 7 academy awards.",
    "birthPlace": "Mexico City, Distrito Federal, Mexico",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Writer",
      "Producer",
      "Director"
    ],
    "knownFor": [
      "tt1454468",
      "tt0206634",
      "tt0245574",
      "tt0304141"
    ]
  },
  {
    "name": "Michel Gondry",
    "birthDate": "1963-05-08T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjEwNDg3MDA1MF5BMl5BanBnXkFtZTcwMDAxMzc1MQ@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0327273",
    "miniBio": "He grew up in Versailles with a family who was very influenced by pop music. When he was young, Gondry wanted to be a painter or an inventor. In the 80s he entered in an art school in Paris where he could develop his graphic skills and where he also met friends with whom he created a pop-rock band called Oui-Oui. The band released 2 albums (\u0027Chacun tout le monde\u0027 and \u0027Formidable\u0027) and several singles until their separation in 1992. Gondry was the drummer of the band and also directed their video clips in which it was possible to see his strange world, influenced by the 60s and by his childhood. One of his videos was shown on MTV and when Björk saw it, she asked him to make her first solo video for \u0027Human Behaviour\u0027. The partnership is famous: Gondry directed five other Björk\u0027s videos, benefiting by the huge budgets. This led to commissions for other artists around the world, including Massive Attack. He also made a lot of commercials for Gap, Smirnoff, Air France, Nike, Coca Cola, Adidas, Polaroid and Levi - the latter making him the most highly-awarded director for a one-off commercial. Hollywood became interested in Gondry\u0027s success and he directed his first feature movie Human Nature (2001), adapting a Charlie Kaufman\u0027s scenario, which was shown in the 2001 Cannes Festival. Although it wasn\u0027t a big success, this film allowed him to direct Eternal Sunshine of the Spotless Mind (2004), for which he again collaborated with Charlie Kaufman. The movie became a popular independent film and he and his co-writers won an Oscar for it.",
    "birthPlace": "Versailles, Yvelines, France",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Director",
      "Writer",
      "Producer"
    ],
    "knownFor": [
      "tt0338013",
      "tt0799934",
      "tt0354899",
      "tt0990407"
    ]
  },
  {
    "name": "Brad Bird",
    "birthDate": "1957-09-24T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTk5Mzg1ODcyNV5BMl5BanBnXkFtZTcwMjU1ODkyMw@@._V1_SY317_CR13,0,214,317_AL_.jpg",
    "id": "nm0083348",
    "miniBio": "Brad Bird was born on September 24, 1957 in Kalispell, Montana, USA as Phillip Bradley Bird. He is known for his work on Ratatouille (2007), The Simpsons (1989) and The Incredibles (2004). He has been married to Elizabeth Canney since 1988. They have three children.",
    "birthPlace": "Kalispell, Montana, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Miscellaneous Crew",
      "Writer",
      "Director"
    ],
    "knownFor": [
      "tt0382932",
      "tt0096697",
      "tt0317705",
      "tt1049413"
    ]
  },
  {
    "name": "Jared Hess",
    "birthDate": "1979-07-18T0:00:00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTI0ODkwODY2OV5BMl5BanBnXkFtZTYwODExNjA3._V1_SY317_CR105,0,214,317_AL_.jpg",
    "id": "nm0381478",
    "miniBio": "Jared Hess was born on July 18, 1979 in Glendale, Arizona, USA as Jared Lawrence Hess. He is a writer and actor, known for Napoleon Dynamite (2004), Super Nacho - O Herói do Wrestling (2006) and Gentlemen Broncos (2009). He is married to Jerusha Hess. They have one child.",
    "birthPlace": "Glendale, Arizona, USA",
    "director": false,
    "actor": true,
    "jobCategories": [
      "Writer",
      "Actor",
      "Camera Department"
    ],
    "knownFor": [
      "tt0374900",
      "tt0457510",
      "tt1161418",
      "tt0398259"
    ]
  },
  {
    "name": "Tom Hanks",
    "birthDate": "1956-07-09",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
    "id": "nm0000158",
    "miniBio": "Thomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family. He moved around a lot after his parents\u0027 divorce, living with a succession of step-families. No problems, no abuse, no alcoholism - just a confused childhood. He had no acting experience in college and, in fact, credits the fact that he couldn\u0027t get cast in a college play with actually starting his career. He went downtown, auditioned for a community theater play, was invited by the director of that play to go to Cleveland, and there his acting career started. He met his second wife, actress Rita Wilson on the set of his television show Bosom Buddies (1980) - she appeared in one episode in the second season (1981), Bosom Buddies: All You Need Is Love (1981). They have two children, and Tom has another son and daughter by his first wife, Samantha Lewes. In 1996, he made his first step behind the camera, directing and writing as well as starring in the film, That Thing You Do! (1996).",
    "birthPlace": "Concord, California, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Producer",
      "Actor",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0382625",
      "tt0109830",
      "tt0120815",
      "tt0120689"
    ]
  },
  {
    "name": "Chris Coppola",
    "birthDate": "00-00-00",
    "picture": "http://ia.media-imdb.com/images/M/MV5BNzQzMjgwODMwOV5BMl5BanBnXkFtZTcwNDk5MDQ1OA@@._V1_SY300_CR119,0,214,300_AL_.jpg",
    "id": "nm0178875",
    "miniBio": "Chris Coppola is an actor, known for The Polar Express (2004), Beowulf (2007) and Postal (2007).",
    "birthPlace": "(not available)",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Soundtrack",
      "Producer"
    ],
    "knownFor": [
      "tt0338348",
      "tt0442933",
      "tt0486640",
      "tt0120177"
    ]
  },
  {
    "name": "Michael Jeter",
    "birthDate": "1952-08-26",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTQ5MDU0MzYzMV5BMl5BanBnXkFtZTYwMTQyMDU1._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0005052",
    "miniBio": "Michael Jeter was born on August 26, 1952 in Lawrenceburg, Tennessee, USA. He was an actor, known for The Green Mile (1999), Jurassic Park III (2001) and Fear and Loathing in Las Vegas (1998). He died on March 30, 2003 in Los Angeles, California, USA.",
    "birthPlace": "Los Angeles, California, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Soundtrack",
      "Director"
    ],
    "knownFor": [
      "tt0120689",
      "tt0163025",
      "tt0120669",
      "tt0316356"
    ]
  },
  {
    "name": "Tim Allen",
    "birthDate": "1953-06-13",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000741",
    "miniBio": "Timothy Allen Dick was born on June 13, 1953, in Denver, Colorado, USA, to Martha Katherine (Fox) and Gerald M. Dick. His father, a real-estate salesman, was killed in a collision with a drunk driver while driving his family home from a University of Colorado football game, when Tim was 11 years-old. His mother, a community-service worker, remarried her high-school sweetheart, an Episcopalian deacon, two years after Tim\u0027s father\u0027s death. Tim has a total of eight siblings. His ancestry includes English, German, Irish, and Scottish. When Tim was young, his family moved to Birmingham, Michigan. In high school, his favorite subject was shop, of course, and after high school, he attended Western Michigan University and graduated with a degree in Television Production in 1975. In 1978, he was arrested on drug charges and spent two years in jail. Upon his release, he had a new outlook on life and on a dare from a friend, started his comedy career at the Comedy Castle in Detroit. Later, he went on to do several cable specials, including, Comedy\u0027s Dirtiest Dozen (1988) and Tim Allen: Men Are Pigs (1990). In 1991, he became the star of his own hit television series on ABC called Home Improvement (1991). While continuing to film his television series throughout most of the 1990s, he starred in a string of blockbuster movies including The Santa Clause (1994), Toy Story (1995), Toy Story 2 (1999) and Galaxy Quest (1999). In August 1996, he developed and unveiled his own signature line of power tools, manufactured by Ryobi. On top of all that, he has his own racing team, Tim Allen/Saleen RRRRacing. In May 1999, he ended his series Home Improvement (1991) after eight seasons and in 2001, he filmed such movies as Big Trouble (2002) and Joe Somebody (2001).",
    "birthPlace": "Denver, Colorado, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Miscellaneous Crew"
    ],
    "knownFor": [
      "tt0101120",
      "tt0114709",
      "tt0435761",
      "tt0120363"
    ]
  },
  {
    "name": "Jamie Lee Curtis",
    "birthDate": "1958-11-22",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTc2ODc3NDcwN15BMl5BanBnXkFtZTcwMzI2MjY4Mg@@._V1_SY317_CR8,0,214,317_AL_.jpg",
    "id": "nm0000130",
    "miniBio": "Jamie Lee Curtis was born on November 22, 1958 in Los Angeles, California, the daughter of legendary actors Janet Leigh and Tony Curtis. She got her big break at acting in 1978 when she won the role of Laurie Strode in Halloween (1978). After that, she became famous for roles in movies like Trading Places (1983), Perfect (1985) and A Fish Called Wanda (1988). She starred in one of the biggest action films ever, True Lies (1994), for which she won a Golden Globe Award for her performance. Curtis also appeared on Buck Rogers in the 25th Century (1979), and starred in Death of a Centerfold: The Dorothy Stratten Story (1981) as the title role. Her first starring role was opposite Richard Lewis on the ABC situation comedy Anything But Love (1989). In 1998, she starred in Halloween H20: 20 Years Later (1998) in which she reprised her role that made her famous back in 1978. Her paternal grandparents were Hungarian Jewish immigrants, while two of her maternal great-grandparents were Danish.",
    "birthPlace": "Los Angeles, California, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Director",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0111503",
      "tt0077651",
      "tt0095159",
      "tt0322330"
    ]
  },
  {
    "name": "Dan Aykroyd",
    "birthDate": "1952-07-01",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000101",
    "miniBio": "Daniel Edward Aykroyd was born on July 1, 1952 in Ottawa, Ontario, Canada, to Lorraine Hélène (Gougeon), a secretary from a French-Canadian family, and Samuel Cuthbert Peter Hugh Aykroyd, a civil engineer who advised prime minister Pierre Trudeau. Aykroyd attended Carleton University in 1969, where he majored in Criminology and Sociology, but he dropped out before completing his degree. He worked as a comedian in various Canadian nightclubs and managed an after-hours speakeasy, Club 505, in Toronto for several years. He worked with Second City Stage Troupe in Toronto and started his acting career at Carleton University with Sock\u0027n\u0027Buskin, the campus theater/drama club. Married to Donna Dixon since 1983, he has two daughters. His parents are named Peter and Lorraine and his brother Peter Aykroyd is a psychic researcher. Dan received an honorary Doctorate from Carleton University in 1994 and was made a Member of the Order of Canada in 1998.",
    "birthPlace": "Ottawa, Ontario, Canada",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Writer",
      "Actor",
      "Producer"
    ],
    "knownFor": [
      "tt0087332",
      "tt0080455",
      "tt0097428",
      "tt0086465"
    ]
  },
  {
    "name": "Lindsay Lohan",
    "birthDate": "1986-07-02",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTcwODEyMDAzM15BMl5BanBnXkFtZTcwMTQ4NTY3OA@@._V1_SY317_CR11,0,214,317_AL_.jpg",
    "id": "nm0517820",
    "miniBio": "Lindsay Dee Lohan was born in New York City on 2 July 1986. Her mother, Dina Lohan (née Donata Melina Nicolette Sullivan), is a former Wall Street analyst, and her father, Michael Lohan, is a businessman and former Wall Street trader. Her parents both have Irish and Italian ancestry. Lohan began her career at age three as a model at the Eileen Ford Agency, and made appearances in over 60 television commercials, including spots for The Gap, Pizza Hut, Wendy\u0027s and Jell-O (opposite Bill Cosby). Lohan made her acting debut in 1996 as the third actress to play Ali Fowler in the television drama Another World (1964). Shortly afterward she was hand-picked by Oscar-nominated writer Nancy Meyers as estranged twin sisters in an adaptation by Walt Disney Pictures of a novel by Erich Kästner, which marked Meyers\u0027 directorial debut. Lohan\u0027s first feature film, The Parent Trap (1998), a remake of The Parent Trap (1961), was a modest commercial success, earning her widespread critical acclaim and a Young Artist award for Best Leading Young Actress in a Feature Film, as well as Blockbuster Entertainment and YoungStar award nominations. After signing a three-movie contract with Disney, she returned to the small screen to star in the made-for-TV movies Life-Size (2000) (opposite Tyra Banks) and Get a Clue (2002) (opposite Bug Hall). She also appeared as Rose in the pilot episode of the short-lived comedy series Bette (2000), which starred Bette Midler. In June 2001 Lohan took a brief hiatus from acting. Her music career was launched over a year later, when Estefan Enterprises made a five-album production deal with her in September 2002, and she signed a recording contract with the reactivated Casablanca Records. However, Lohan was not turning her back on her blossoming acting career. Just over a month previously she had been cast opposite Jamie Lee Curtis for another Disney adaptation of a novel, this time a fantasy comedy by Mary Rodgers. Freaky Friday (2003), a remake of Freaky Friday (1976), was a huge hit (generating over $160 million in worldwide box office receipts) and critics were spellbound by delightful performances from Lohan and Curtis (who went on to receive a Golden Globe nomination for her work). In addition, Lohan won the 2004 MTV Movie Award for Best Breakthrough Female, as well as a Saturn award nomination and another Young Artist award nomination. Lohan relocated permanently to Los Angeles between projects and moved into an apartment with fellow actress Raven-Symoné. She also dated pop star Aaron Carter for a short time. Her next acting role was the title character in the comedy Confessions of a Teenage Drama Queen (2004), a Disney adaptation of the novel by Dyan Sheldon. The film received scathing reviews upon its release and died a quick death at the box office, but even the harshest of critics were impressed by Lohan\u0027s charming turn as aspiring actress Lola. Lohan\u0027s next project, Mean Girls (2004), saw her reunite with Freaky Friday (2003) director Mark Waters. Inspired by a non-fiction book by Rosalind Wiseman and written by Saturday Night Live (1975) scribe Tina Fey, the high-school comedy-drama opened to glowing reviews and grossed $86 million in the US. This earned her status as a bankable actress, and a salary of $7.5 million for the Donald Petrie romantic comedy Just My Luck (2006). One of the most sought-after young actresses in the industry, she starred in Bobby (2006) (opposite Demi Moore and Sharon Stone), the Disney fantasy adventure Herbie Fully Loaded (2005) (a pseudo-sequel to The Love Bug (1968)) and the critically acclaimed A Prairie Home Companion (2006). On top of a thriving film career Lohan also launched a music career, releasing her debut album, \"Speak,\" which hit shelves in December 2004. In 2009 Lohan launched her own fashion line titled 6126, mainly focusing on the production of women\u0027s leggings. By spring she launched a self-tanning spray line titled \"Sevin Nyne\" and by the end of the year she became an artistic designer for fashion house Ungaro. Lindsay continues her career in acting, having played a supporting role in the action film Machete (2010).",
    "birthPlace": "New York City, New York, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Soundtrack",
      "Producer"
    ],
    "knownFor": [
      "tt0400497",
      "tt0377092",
      "tt0120783",
      "tt0322330"
    ]
  },
  {
    "name": "Jonathan Bennett",
    "birthDate": "1981-06-10",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjI1MzkwOTM0OF5BMl5BanBnXkFtZTgwODUyNDM4MTE@._V1_SY317_CR7,0,214,317_AL_.jpg",
    "id": "nm1057932",
    "miniBio": "Jonathan David Bennett was born in Rossford, Ohio, to RuthAnne (Mason) and Dr. David Paul Bennett. He headed straight to New York to pursue acting after graduating from the theater program at Otterbein. He was actually discovered by an agent while sitting on a train. Six months later he signed on to the iconic soap opera \"All My Children,\" playing J.R. Chandler. Since then Jonathan\u0027s career has been on fire. He has appeared in a slew of teen comedies, side-by-side with some of the biggest and brightest stars of their time including; \"Cheaper by the Dozen 2\" (with Steve Martin) and \"Lovewrecked\" (with Amanda Bynes). He also stepped into and took over the iconic role replacing Ryan Reynolds as Van Wilder in \"Van Wilder: Freshman Year.\"",
    "birthPlace": "Rossford, Ohio, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0377092",
      "tt1276434",
      "tt0452598",
      "tt0800328"
    ]
  },
  {
    "name": "Rachel McAdams",
    "birthDate": "1978-11-17",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTY5ODcxMDU4NV5BMl5BanBnXkFtZTcwMjAzNjQyNQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
    "id": "nm1046097",
    "miniBio": "Rachel McAdams was born on November 17, 1978, in London, Ontario, Canada, to Sandra Kay (Gale), a nurse, and Lance Frederick McAdams, a truck driver and furniture mover. She is of English, Welsh, Irish, and Scottish descent. Rachel became involved with acting as a teenager and by the age of 13 was performing in Shakespearean productions in summer theater camp; she went on to graduate with honors with a BFA degree in Theater from York University. After her debut in an episode of Disney\u0027s The Famous Jett Jackson (1998), she co-starred in the Canadian TV series Slings and Arrows (2003), a comedy-drama about the trials and travails of a Shakespearean theater group, and won a Gemini award for her performance in 2003. Her breakout role as Regina George in the hit comedy Mean Girls (2004) instantly catapulted her onto the short list of Hollywood\u0027s hottest young actresses. She followed that film with a star turn opposite Ryan Gosling in the adaptation of the Nicholas Sparks bestseller The Notebook (2004), which was a surprise box office success and became the predominant romantic drama for a new, young generation of moviegoers. After filming, McAdams and Gosling became romantically involved and dated through mid-2007. McAdams next showcased her versatility onscreen with the manic comedy Wedding Crashers (2005), the thriller Red Eye (2005), and the holiday drama The Family Stone (2005). McAdams then explored the independent film world with Married Life (2007), which premiered at the Toronto Film Festival and also starred Pierce Brosnan, Chris Cooper and Patricia Clarkson. Starring roles in the military drama The Lucky Ones (2008), the newspaper thriller State of Play (2009), and the romance The Time-Traveler\u0027s Wife (2009) followed before she starred opposite Robert Downey Jr. and Jude Law in Guy Ritchie\u0027s international blockbuster Sherlock Holmes (2009). McAdams played the plucky producer of a failing morning TV show in Morning Glory (2010), the materialistic fiancée of Owen Wilson in Woody Allen\u0027s Meia-Noite em Paris (2011), and returned to romantic drama territory with the hit film The Vow (2012) opposite Channing Tatum. The actress also stars with Ben Affleck in Terrence Malick\u0027s To the Wonder (2012) and alongside Noomi Rapace in \u0027Brian DePalma\u0027\u0027s thriller Paixão (2012). In 2005, McAdams received ShoWest\u0027s \"Supporting Actress of the Year\" Award as well as the \"Breakthrough Actress of the Year\" at the Hollywood Film Awards. In 2009, she was awarded with ShoWest\u0027s \"Female Star of the Year.\" As of 2011, she has been romantically linked with her Midnight in Paris co-star Michael Sheen.",
    "birthPlace": "London, Ontario, Canada",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0988045",
      "tt1605783",
      "tt0377092",
      "tt1606389"
    ]
  },
  {
    "name": "Brad Pitt",
    "birthDate": "1963-12-18",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjA1MjE2MTQ2MV5BMl5BanBnXkFtZTcwMjE5MDY0Nw@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000093",
    "miniBio": "An actor and producer known as much for his versatility as he is for his handsome face, Golden Globe-winning actor Brad Pitt\u0027s most widely recognized role may be Tyler Durden in Fight Club (1999). But his portrayals of Billy Beane in Moneyball (2011), and Rusty Ryan in the remake of Ocean\u0027s Eleven (2001) and its sequels, also loom large in his filmography. Pitt was born William Bradley Pitt on December 18th, 1963, in Shawnee, Oklahoma, and was raised in Springfield, Missouri. He is the son of Jane Etta (Hillhouse), a school counselor, and William Alvin Pitt, a truck company manager. He has a younger brother, Douglas (Doug) Pitt, and a younger sister, Julie Neal Pitt. At Kickapoo High School, Pitt was involved in sports, debating, student government and school musicals. Pitt attended the University of Missouri, where he majored in journalism with a focus on advertising. He occasionally acted in fraternity shows. He left college two credits short of graduating to move to California. Before he became successful at acting, Pitt supported himself by driving strippers in limos, moving refrigerators and dressing as a giant chicken while working for \"el Pollo Loco\". Pitt\u0027s earliest credited roles were in television, starting on the daytime soap opera Another World (1964) before appearing in the recurring role of Randy on the legendary prime time soap opera Dallas (1978). Following a string of guest appearances on various television series through the 1980s, Pitt gained widespread attention with a small part in Thelma \u0026 Louise (1991), in which he played a sexy criminal who romanced and conned Geena Davis. This lead to starring roles in badly received films such as Johnny Suede (1991) and Cool World (1992). But Pitt\u0027s career hit an upswing with his casting in A River Runs Through It (1992), which cemented his status as an multi-layered actor as opposed to just a pretty face. Pitt\u0027s subsequent projects were as quirky and varied in tone as his performances, ranging from his unforgettably comic cameo as stoner roommate Floyd in True Romance (1993) to romantic roles in such visually lavish films as Interview with the Vampire: The Vampire Chronicles (1994) and Legends of the Fall (1994), to an emotionally tortured detective in the horror-thriller Se7en (1995). His portrayal of frenetic oddball Jeffrey Goines in Twelve Monkeys (1995) won him a Globe for Best Performance by an Actor in a Supporting Role. Pitt\u0027s portrayal of Achilles in the big-budget period drama Troy (2004) helped establish his appeal as action star and was closely followed by a co-starring role in the stylish spy-versus-spy flick Mr. \u0026 Mrs. Smith (2005). It was on the set of Mr. \u0026 Mrs. Smith that Pitt, who married Jennifer Aniston in a highly publicized ceremony in 2000, met his current partner Angelina Jolie. Pitt left Aniston for Jolie in 2005, a break-up that continues to fuel tabloid stories years after its occurrence. He continues to wildly vary his film choices, appearing in everything from high-concept popcorn flicks such as Megamind (2010) to adventurous critic-bait like Inglourious Basterds (2009) and The Tree of Life (2011). He has received two Best Actor Oscar nominations, for The Curious Case of Benjamin Button (2008) and Moneyball (2011). In 2014, he starred in the war film Fury (2014), opposite Shia LaBeouf, Logan Lerman, Jon Bernthal, and Michael Peña. Pitt and Jolie have six children, including two sons and a daughter who were adopted.",
    "birthPlace": "Shawnee, Oklahoma, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0361748",
      "tt0137523",
      "tt0816711",
      "tt0421715"
    ]
  },
  {
    "name": "Eric Bana",
    "birthDate": "1968-08-09",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjA2NDAyMDg2M15BMl5BanBnXkFtZTYwODcwNzA1._V1_SY317_CR5,0,214,317_AL_.jpg",
    "id": "nm0051509",
    "miniBio": "Eric Bana was born Eric Banadinovic on August 9, 1968, in Melbourne, Victoria, Australia. He is the younger of two brothers. His father, named Ivan Banadinovic, came from Zagreb, Croatia, and worked as a manager for Caterpillar Inc. His mother, named Eleanor Banadinovic, came from a German family and was a hairdresser. Young Bana grew up in suburban Melbourne. He was popular among his schoolmates for his talent of making comic impressions of his teachers. At that time, he was fond of Mel Gibson in Mad Max - As Motos da Morte (1979) and also decided to become an actor. He moved to Sydney and worked odd jobs to support himself. In 1991, he began a career as a stand-up comedian, while working as a barman at Melbourne\u0027s Castle Hotel. In 1993, Bana made his television debut on Steve Vizard\u0027s Tonight Live with Steve Vizard (1990) talk show, then joined the Full Frontal (1993) TV-series. He gained popularity for making impressions of Arnold Schwarzenegger, Sylvester Stallone, Tom Cruse and \"Colombo\". In 1996, he started his own show titled Eric (1997), then launched a comedy series titled The Eric Bana Show Live (1997). The show was canceled for the lack of substantial audience, however, in 1997, Bana received the Logie Award for \"Most Popular Comedian\" for his work on The Eric Bana Show Live (1997). He made his film debut in The Castle (1997), in a supporting comic role. That same year, he was cast to portray Mark \"Chopper\" Read, the notorious Australian underworld figure. For the role, Bana gained 30 pounds, by eating junk food; he also spent a few days with Read in prison, in order to perfect his mimicry. Bana completely transformed himself into a bald, fat, disturbed criminal. He would arrive on the film set at four in the morning, spending several hours in makeup, being tattooed exactly like Read. Chopper (2000) became an international success and won three Australian Film Institute Awards. Bana won the Best Actor at the 2000 Stockholm Film Festival and also the AFI 2000 Best Actor Award. Then he co-starred in Black Hawk Down (2001), then starred in Hulk (2003). In 2002, he was cast as a Trojan \"Prince Hector\" in the historical epic Troy (2004), after being recommended by Brad Pitt, who admired Bana for his work in Chopper (2000). In 2005, Bana co-starred with Daniel Craig and Geoffrey Rush in the political drama Munich (2005) directed by Steven Spielberg. In 1995, he began dating Rebecca Gleeson, a publicist and daughter of Australian High Court Chief Justice Murray Gleeson. The following year, he was named \"Bachelor of the Year\" by Cleo Magazine, and won a trip for two to the United States. He invited Gleeson, and proposed to her during that romantic trip. In 1997, the two were married; their son, Klaus, was born in 1999, their daughter, Sophia, was born in 2002. He currently resides in Melbourne with his wife and their two children. Bana is a passionate supporter of Australian football.",
    "birthPlace": "Melbourne, Victoria, Australia",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Writer",
      "Producer"
    ],
    "knownFor": [
      "tt0796366",
      "tt0408306",
      "tt0286716",
      "tt0217960"
    ]
  },
  {
    "name": "Orlando Bloom",
    "birthDate": "1977-01-13",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjE1MDkxMjQ3NV5BMl5BanBnXkFtZTcwMzQ3Mjc4MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
    "id": "nm0089217",
    "miniBio": "Orlando Jonathan Blanchard Bloom was born in Canterbury, Kent, England on January 13, 1977. His mother, Sonia Constance Josephine (Copeland), was born in Kolkata, India, to an English family then-resident there. The man he briefly knew as his father, Harry Bloom, was a legendary political activist who fought for civil rights in South Africa. But Harry died of a stroke when Orlando was only four years old. After that, Orlando and his older sister, Samantha Bloom, were raised by their mother and family friend, Colin Stone. When Orlando was 13, Sonia revealed to him that Colin was actually his biological father. Orlando attended St. Edmunds School in Canterbury but struggled in many courses because of dyslexia. He did embrace the arts, however, and enjoyed pottery, photography and sculpturing. He also participated in school plays and was active at his local theater. As a teen, Orlando landed his first job: he was a clay trapper at a pigeon shooting range. Encouraged by his mother, he and his sister began studying poetry and prose, eventually giving readings at Kent Festival. Orlando and Samantha won many poetry and Bible reciting competitions. Then Orlando, who always idolized larger-than-life characters, gravitated towards serious acting. At the age of 16, he moved to London and joined the National Youth Theatre, spending two seasons there and gaining a scholarship to train with the British American Drama Academy. Like many young actors, he also auditioned for a number of television roles to further his career, landing bit parts in British television shows Casualty (1986), Midsomer Murders (1997) and Smack the Pony (1999). He also appeared in the critically acclaimed movie Wilde (1997). He then attended the Guildhall School of Music and Drama. It was there, in 1998, that Orlando fell three stories from a rooftop terrace and broke his back. Despite fears that he would be permanently paralyzed, he quickly recovered and returned to the stage. As fate would have it, seated in the audience one night in 1999 was a director named Peter Jackson. After the show, he met with Orlando and asked him to audition for his new set of movies. After graduating from Guildhall, Orlando began work on the \"Lord of the Rings\" trilogy, spending 18 months in New Zealand bringing to life \"Legolas\", a part which made him a household name. Today, he is one of the busiest and most sought-after actors in the industry.",
    "birthPlace": "Canterbury, Kent, England, UK",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0325980",
      "tt0120737",
      "tt0167261",
      "tt0167260"
    ]
  },
  {
    "name": "Matt Stone",
    "birthDate": "1971-05-26",
    "picture": "http://ia.media-imdb.com/images/M/MV5BODQwMDA1MDQ2M15BMl5BanBnXkFtZTYwMTIxMTQ0._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0001778",
    "miniBio": "Matt Stone was born on May 26, 1971 in Houston, Texas, USA as Matthew Richard Stone. He is a writer and producer, known for South Park: Bigger Longer \u0026 Uncut (1999), South Park (1997) and Team America: World Police (2004). He has been married to Angela Howard since 2008. They have two children.",
    "birthPlace": "Houston, Texas, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Writer",
      "Producer",
      "Actor"
    ],
    "knownFor": [
      "tt0158983",
      "tt0121955",
      "tt0372588",
      "tt1308667"
    ]
  },
  {
    "name": "Elle Russ",
    "birthDate": "1977-08-19",
    "picture": "",
    "id": "nm1224826",
    "miniBio": "An alumni of the world famous comedy theater, The Second City - Chicago. Elle studied at the American Conservatory Theater in San Francisco and with Byrne Piven in Chicago. She is a main-company member at Acme Comedy Theater where she has performed in over 150 live shows (sketch comedy and improv). Elle is a professional TV/FILM writer and all-around athlete.",
    "birthPlace": "Chicago, Illinois, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Writer"
    ],
    "knownFor": []
  },
  {
    "name": "Gena Rowlands",
    "birthDate": "1930-06-19",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjA4MzAwMTQ1Ml5BMl5BanBnXkFtZTYwMzQyNjMz._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0001687",
    "miniBio": "Gena Rowlands was born on June 19, 1930 in Madison, Wisconsin, USA as Virginia Cathryn Rowlands. She is an actress, known for The Notebook (2004), The Skeleton Key (2005) and Night on Earth (1991). She was previously married to John Cassavetes.",
    "birthPlace": "Madison, Wisconsin, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Writer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0332280",
      "tt0397101",
      "tt0102536",
      "tt0364045"
    ]
  },
  {
    "name": "James Garner",
    "birthDate": "1928-04-07",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTM1Nzk2NTA3Nl5BMl5BanBnXkFtZTcwMzEzODI0NA@@._V1_SY317_CR0,0,214,317_AL_.jpg",
    "id": "nm0001258",
    "miniBio": "Amiable and handsome James Garner had obtained success in both films and television, often playing variations of the charming anti-hero/con-man persona he first developed in Maverick, the offbeat western TV series that shot him to stardom in the late 1950s. James Garner was born James Scott Bumgarner in Norman, Oklahoma, to Mildred Scott (Meek) and Weldon Warren Bumgarner, a carpet layer. He dropped out of high school at 16 to join the Merchant Marines. He worked in a variety of jobs and received 2 Purple Hearts when he was wounded twice during the Korean War. He had his first chance to act when a friend got him a non-speaking role in the Broadway stage play \"The Caine Mutiny Court Martial (1954)\". Part of his work was to read lines to the lead actors and he began to learn the craft of acting. This play led to small television roles, television commercials and eventually a contract with Warner Brothers. Director David Butler saw something in Garner and gave him all the attention he needed when he appeared in The Girl He Left Behind (1956). After co-starring in a handful of films during 1956-57, Warner Brothers gave Garner a co-starring role in the the western series Maverick (1957). Originally planned to alternate between Bart Maverick (Jack Kelly) and Bret Maverick (Garner), the show quickly turned into the Bret Maverick Show. As Maverick, Garner was cool, good-natured, likable and always ready to use his wits to get him in or out of trouble. The series was highly successful, and Garner continued in it into 1960 when he left the series in a dispute over money. In the early 1960s Garner returned to films, often playing the same type of character he had played on \"Maverick\". His successful films included The Thrill of It All (1963), Move Over, Darling (1963), The Great Escape (1963) and The Americanization of Emily (1964). After that, his career wandered and when he appeared in the automobile racing movie Grand Prix (1966), he got the bug to race professionally. Soon, this ambition turned to supporting a racing team, not unlike what Paul Newman would do in later years. Garner found great success in the western comedy Support Your Local Sheriff! (1969). He tried to repeat his success with a sequel, Support Your Local Gunfighter (1971), but it wasn\u0027t up to the standards of the first one. After 11 years off the small screen, Garner returned to television in a role not unlike that in Support Your Local Sheriff! (1969). The show was Nichols (1971) and he played the sheriff who would try to solve all problems with his wits and without gun play. When the show was canceled, Garner took the news by having Nichols shot dead, never to return in a sequel. In 1974 he got the role for which he will probably be best remembered, as wry private eye Jim Rockford in the classic The Rockford Files (1974). This became his second major television hit, with Noah Beery Jr. and Stuart Margolin, and in 1977 he won an Emmmy for his portrayal. However, a combination of injuries and the discovery that Universal Pictures\u0027 \"creative bookkeeping\" would not give him any of the huge profits the show generated soon soured him and the show ended in 1980. In the 1980s Garner appeared in few movies, but the ones he did make were darker than the likable Garner of old. These included Tank (1984) and Murphy\u0027s Romance (1985). For the latter, he was nominated for both the Academy Award and a Golden Globe. Returning to the western mode, he co-starred with the young Bruce Willis in Sunset (1988), a mythical story of Wyatt Earp, Tom Mix and 1920s Hollywood. In the 1990s Garner received rave reviews for his role in the acclaimed television movie about corporate greed, Barbarians at the Gate (1993). After that he appeared in the theatrical remake of his old television series, Maverick (1994), opposite Mel Gibson. Most of his appearances after that were in numerous TV movies based upon The Rockford Files (1974). His most recent films were My Fellow Americans (1996) and Space Cowboys (2000) .",
    "birthPlace": "Brentwood, Los Angeles, California, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0071042",
      "tt0332280",
      "tt0057115",
      "tt0230011"
    ]
  },
  {
    "name": "Daniel Radcliffe",
    "birthDate": "1989-07-23",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTg4NTExODc3Nl5BMl5BanBnXkFtZTgwODUyMDEzMDE@._V1_SY317_CR11,0,214,317_AL_.jpg",
    "id": "nm0705356",
    "miniBio": "Daniel Jacob Radcliffe was born on July 23rd, 1989 to literary agent Alan Radcliffe and casting agent Marcia Gresham. His father is from a Northern Irish Protestant background, while his mother was born in South Africa, to a Jewish family (from Lithuania, Poland, Russia, and Germany). Daniel began performing in small school productions as a young boy. Soon enough, he landed a role in David Copperfield (1999), as the young David Copperfield. A couple of years later, he landed a role as Mark Pendel in The Tailor of Panama (2001), the son of Harry and Louisa Pendel (Geoffrey Rush and Jamie Lee Curtis). Lee Curtis had indeed pointed out to Daniel\u0027s mother that he could be Harry Potter himself. Soon afterwards, Daniel was cast as Harry Potter by director, Chris Columbus in the film that hit theatres in November 16, 2001, Harry Potter and the Sorcerer\u0027s Stone (2001). He was recognized worldwide after this film was released. Pleasing audiences and critics everywhere, filming on its sequel, Harry Potter and the Chamber of Secrets (2002), commenced shortly afterwards. He appeared again as Harry in Harry Potter and the Prisoner of Azkaban (2004) directed by Alfonso Cuarón, and then appeared in Harry Potter and the Goblet of Fire (2005) directed by Mike Newell. Shortly afterwards, he finished filming Os Rapazes de Dezembro (2007) in Adelaide, Australia, Kangaroo Island, and Geelong, Australia which began on the 14th of November, 2005 and ended sometime in December. On January 27th, 2006, he attended the South Bank Awards Show to present the award for \"Breakthrough Artist of the Year\" to Billie Piper. Dan reprised his famous character once again for the next installment of the Harry Potter series, Harry Potter and the Order of the Phoenix (2007). In February 2007, he took on his first stage role in the West End play Equus, to worldwide praise from fans and critics alike. Also that year, he starred in the television movie My Boy Jack (2007), which aired on 11 November 2007 in the UK. Now being one of the world\u0027s most recognizable people, Daniel leads a somewhat normal life. He has made friends working on the Harry Potter films, which include his co-stars Rupert Grint and Emma Watson.",
    "birthPlace": "Fulham, London, England, UK",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0295297",
      "tt0304141",
      "tt0373889",
      "tt0417741"
    ]
  },
  {
    "name": "Emma Watson",
    "birthDate": "1990-04-15",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTQ3ODE2NTMxMV5BMl5BanBnXkFtZTgwOTIzOTQzMjE@._V1_SY317_CR21,0,214,317_AL_.jpg",
    "id": "nm0914612",
    "miniBio": "Emma Watson was born in Paris, France, to English parents, Jacqueline Luesby and Chris Watson, both lawyers. She moved to Oxfordshire when she was five, where she attended the Dragon School. From the age of six, Emma knew that she wanted to be an actress and, for a number of years, she trained at the Oxford branch of Stagecoach Theatre Arts, a part-time theatre school where she studied singing, dancing and acting. By the age of ten, she had performed and taken the lead in various Stagecoach productions and school plays. In 1999, casting began for Harry Potter and the Philosopher\u0027s Stone (2001), the film adaptation of British author J.K. Rowling\u0027s bestselling novel. Casting agents found Emma through her Oxford theatre teacher. After eight consistent auditions, producer David Heyman told Emma and fellow applicants, Daniel Radcliffe and Rupert Grint, that they had been cast for the roles of the three leads, Hermione Granger, Harry Potter and Ron Weasley. The release of Harry Potter and the Philosopher\u0027s Stone (2001) was Emma\u0027s cinematic screen debut. The film broke records for opening-day sales and opening-weekend takings and was the highest-grossing film of 2001. Critics praised the film and the performances of the three leading young actors. The highly distributed British newspaper, \u0027The Daily Telegraph\u0027, called her performance \"admirable\". Later, Emma was nominated for five awards for her performance in the film, winning the Young Artist Award for Leading Young Actress in a Feature Film. Since the release of the first film of the highly successful franchise, Emma has quickly become one of the most well-known actresses in the world. She continued to play the role of Hermione Granger for nearly ten years, in all of the following Harry Potter films: Harry Potter and the Philosopher\u0027s Stone (2001), Harry Potter and the Chamber of Secrets (2002), Harry Potter and the Prisoner of Azkaban (2004), Harry Potter and the Goblet of Fire (2005), Harry Potter and the Order of the Phoenix (2007), Harry Potter and the Half-Blood Prince (2009), Harry Potter and the Deathly Hallows: Part 1 (2010), and Harry Potter and the Deathly Hallows: Part 2 (2011). Emma acquired two Critics\u0027 Choice Award nominations from the Broadcast Film Critics Association for her work in Harry Potter And The Prisoner Of Azkaban and Harry Potter And The Goblet Of Fire. The completion of the seventh and eight movies saw Emma receive nominations in 2011 for a Nickelodeon Kids\u0027 Choice Award, and for Best Actress at the Jameson Empire Awards. The Harry Potter franchise won the BAFTA for Outstanding British Contribution to Cinema in February 2011. 2011 saw Emma in Simon Curtis\u0027s My Week With Marilyn (2011), alongside a stellar cast of Oscar nominees including Michelle Williams as Marilyn Monroe and Kenneth Branagh as Sir Laurence Olivier, in addition to Eddie Redmayne, Dame Judi Dench, Dougray Scott, Zoe Wanamaker, Toby Jones and Dominic Cooper. Chronicling a week in Marilyn Monroe\u0027s life, the film featured Emma in the supporting role of Lucy, a costume assistant to Colin Clark (Redmayne). The film was released by The Weinstein Company and was nominated for a Golden Globe for Best Motion Picture - Comedy or Musical. In 2012 Emma was seen in Stephen Chbosky\u0027s adaptation of his coming-of-age novel The Perks Of Being A Wallflower (2012), starring opposite Logan Lerman and Ezra Miller. This independent drama centred around Charlie (Lerman), an introverted freshman who is taken under the wings of two seniors (Watson and Miller) who welcome him to the real world. The film premiered at the 2012 Toronto International Film Festival and received rave reviews. The film won the People\u0027s Choice Award for Favourite Dramatic Movie and Emma also picked up the People\u0027s Choice Award for Favourite Dramatic Movie Actress. Emma was awarded a second time for this role with the Best Supporting Actress Award at the San Diego Film Critics Society Awards where the film also won the Best Ensemble Performance Award. Last summer, Emma starred in Sofia Coppola\u0027s American satirical black comedy crime film, The Bling Ring (2013). The film took inspiration from real events and followed a group of teenagers who, obsessed with fashion and fame, burgled the homes of celebrities in Los Angeles. The film opened the Un Certain Regard section of the 2013 Cannes Film Festival. Emma also appeared in a cameo role as herself in Seth Rogen\u0027s apocalypse comedy This Is The End (2013). The film tells the story about what happens to some of Hollywood\u0027s best loved celebrities when the apocalypse strikes during a party at James Franco\u0027s house. Emma was most recently seen in Darren Aronofsky\u0027s Noah (2014) opposite Russell Crowe, Jennifer Connelly, Ray Winstone, Douglas Booth, Logan Lerman and Anthony Hopkins. The film told the epic, biblical tale of Noah and the ark. Emma plays the role of Ila, a young woman who develops a close relationship with Noah\u0027s son, Shem (Booth). Noah has made an outstanding $300m since its release in March. Emma has completed filming her next project, Regression, written and directed by Alejandro Amenábar. Emma will star in the thriller opposite Oscar nominated Ethan Hawke. Set in Minnesota 1990, Regression tells the story of Detective Bruce Kenner (Hawke) who investigates the case of young Angela, played by Emma, who accuses her father of sexual abuse. The film is expected to be released next year. Emma will next play, Kelsea Glynn in the film adaptation of The Queen Of The Tearling, Erika Johansen\u0027s page-turner of a novel about a young woman raised by foster parents in a cottage hidden away in a remote forest. On her 19th birthday, Kelsea is removed from her home to take her rightful place as sovereign of a fictional post-utopian country that hides dark secrets and is menaced by a neighbouring monarch. The screenplay for The Queen Of The Tearling has been written by Mark L. Smith. David Heyman will be producing the film and Emma will also serve as an executive producer. David and Emma worked together on all the Harry Potter films. The producer snapped up the rights to J.K. Rowling\u0027s Harry Potter series very early, before publication; and he and Warner Bros have done the same thing with the Tearling trilogy. Filming is due to commence next year. In 2012 Emma was honoured with the Calvin Klein Emerging Star Award at the ELLE Women in Hollywood Awards. In 2013, Emma was awarded the Trailblazer Award at the MTV Movie Awards in April and was honoured with the GQ Woman of the Year Award at the GQ Awards in September. Further to her acting career, Emma is a Goodwill Ambassador for the UN, promoting gender equality and the empowerment of women. Emma graduated from Brown University in May 2014.",
    "birthPlace": "Paris, France",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0926084",
      "tt0241527",
      "tt0295297",
      "tt1201607"
    ]
  },
  {
    "name": "Rupert Grint",
    "birthDate": "1988-08-24",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjI3MDA3NjA1N15BMl5BanBnXkFtZTcwMDcyMDYzNw@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0342488",
    "miniBio": "Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters. His brother James was born when Rupert was a year old, Georgina and Samantha were born in 1993 and 1996 respectively, and last, but not least, Charlotte, who was born in 1999. Rupert grew up in Hertfordshire, the English county directly to the north of London, conveniently placed for commuting to Leavesden Film Studios. Before successfully auditioning for the Harry Potter films, Rupert attended Richard Hale Secondary School in Hertford: here he took an active interest in school plays, being cast as Rumplestilskin in the Brothers Grimm fairy tales. He was also a regular attendee at weekend drama classes at Top Hat Stage School, also in Hertford. Time at school was limited, as Rupert was needed on set for the Harry Potter films, where all of the child actors were tutored for four hours a day on set, to keep up with legal requirements. During the summer of 2004, he took his GCSE (General Certificate of Secondary Education) exams and completed his formal education.",
    "birthPlace": "Stevenage, Hertfordshire, England, UK",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0295297",
      "tt1201607",
      "tt0330373",
      "tt0926084"
    ]
  },
  {
    "name": "Jim Carrey",
    "birthDate": "1962-01-17",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTQwMjAwNzI0M15BMl5BanBnXkFtZTcwOTY1MTMyOQ@@._V1_SY317_CR22,0,214,317_AL_.jpg",
    "id": "nm0000120",
    "miniBio": "Jim Carrey, Canadian-born and a U.S. citizen since 2004, is an actor and producer famous for his rubbery body movements and flexible facial expressions. The two-time Golden Globe-winner rose to fame as a cast member of the Fox sketch comedy In Living Color (1990) but leading roles in Ace Ventura: Pet Detective (1994), Dumb \u0026 Dumber (1994) and The Mask (1994) established him as a bankable comedy actor. James Eugene Carrey was born on January 17, 1962, in Ontario, Canada, and is the youngest of four children of Kathleen (Oram), a homemaker, and Percy Carrey, an accountant and jazz musician. The family surname was originally \"Carré\", and he has French-Canadian, Scottish, and Irish ancestry. Carrey was an incurable extrovert from day one. As a child, he performed constantly, for anyone who would watch, and even mailed his résumé to The Carol Burnett Show (1967) at age 10. In junior high, he was granted a few precious minutes at the end of each school day to do stand-up routines for his classmates (provided, of course, that he kept a lid on it the rest of the day). Carrey\u0027s early adolescence took a turn for the tragic, however, when the family was forced to relocate from their cozy town of Newmarket to Scarborough (a Toronto suburb). They all took security and janitorial jobs in the Titan Wheels factory, Jim working 8-hour shifts after school let out (not surprisingly, his grades and morale both suffered). When they finally deserted the factory, the family lived out of a Volkswagen camper van until they could return to Toronto. Carrey made his stand-up debut in Toronto after his parents and siblings got back on their feet. He made his (reportedly awful) professional stand-up debut at Yuk-Yuk\u0027s, one of the many local clubs that would serve as his training ground in the years to come. He dropped out of high school, worked on his celebrity impersonations (among them Michael Landon and James Stewart), and in 1979 worked up the nerve to move to Los Angeles. He finessed his way into a regular gig at The Comedy Store, where he impressed Rodney Dangerfield so much that the veteran comic signed him as an opening act for an entire season. During this period Carrey met and married waitress Melissa Womer, with whom he had a daughter (Jane). The couple would later go through a very messy divorce, freeing Carrey up for a brief second marriage to actress Lauren Holly. Wary of falling into the lounge act lifestyle, Carrey began to look around for other performance outlets. He landed a part as a novice cartoonist in the short-lived sitcom The Duck Factory (1984); while the show fell flat, the experience gave Carrey the confidence to pursue acting more vigorously. Carrey also worked on breaking into film around this time. He scored the male lead in the ill-received Lauren Hutton vehicle Once Bitten (1985), and had a supporting role in Peggy Sue Got Married (1986), before making a modest splash with his appearance as the alien Wiploc in Earth Girls Are Easy (1988). Impressed with Carrey\u0027s lunacy, fellow extraterrestrial Damon Wayans made a call to his brother, Keenen Ivory Wayans, who was in the process of putting together the sketch comedy show In Living Color (1990). Carrey joined the cast and quickly made a name for himself with outrageous acts (one of his most popular characters, psychotic Fire Marshall Bill, was attacked by watchdog groups for dispensing ill- advised safety tips). Following his time on In Living Color (1990), Carrey\u0027s transformation from TV goofball to marquee headliner happened within the course of a single year. He opened 1994 with a starring turn in Ace Ventura: Pet Detective (1994), a film that cashed in on his extremely physical brand of humor (the character\u0027s trademark was talking out his derrière). Next up was the manic superhero movie The Mask (1994), which had audiences wondering just how far Carrey\u0027s features could stretch. Finally, in December 1994, he hit theaters as a loveable dolt in the Farrelly brothers\u0027 Dumb \u0026 Dumber (1994) (his first multi-million dollar payday). Now a box-office staple, Carrey brought his manic antics onto the set of Batman Forever (1995), replacing Robin Williams as The Riddler. He also filmed the follow-up to his breakthrough, Ace Ventura: When Nature Calls (1995), and inked a deal with Sony to star in The Cable Guy (1996) (replacing Chris Farley) for a cool $20 million--at the time, that was the biggest up-front sum that had been offered to any comic actor. The movie turned out to be a disappointment, both critically and financially, but Carrey bounced back the next year with the energetic hit Liar Liar (1997). Worried that his comic shtick would soon wear thin, Carrey decided to change course. In 1998, he traded in the megabucks and silly grins to star in Peter Weir\u0027s The Truman Show (1998) playing a naive salesman who discovers that his entire life is the subject of a TV show, Carrey demonstrated an uncharacteristic sincerity that took moviegoers by surprise. He won a Golden Globe for the performance, and fans anticipated an Oscar nomination as well--when it didn\u0027t materialize, Carrey lashed out at Academy members for their narrow-minded selection process. Perhaps inspired by the snub, Carrey threw himself into his next role with abandon. After edging out a handful of other hopefuls (including Edward Norton) to play eccentric funnyman Andy Kaufman in Man on the Moon (1999), Carrey disappeared into the role, living as Kaufman -- and his blustery alter-ego Tony Clifton -- for months (Carrey even owned Kaufman\u0027s bongo drums, which he\u0027d used during his audition for director Milos Forman). His sometimes uncanny impersonation was rewarded with another Golden Globe, but once again the Academy kept quiet. An indignant Carrey next reprised his bankable mania for the Farrelly brothers in Me, Myself \u0026 Irene (2000), playing a state trooper whose Jekyll and Hyde personalities both fall in love with the same woman (Renée Zellweger). Carrey\u0027s real-life persona wound up falling for her too--a few months after the film wrapped, the pair announced they were officially a couple. By then, Carrey had already slipped into a furry green suit to play the stingy antihero of Ron Howard\u0027s How the Grinch Stole Christmas (2000). Although Carrey maintains a foothold in the comedy world with films such as Bruce Almighty (2003) and Mr. Popper\u0027s Penguins (2011), he is also capable of turning in nuanced dramatic performances, as demonstrated in films like Eternal Sunshine of the Spotless Mind (2004) and the drama/comedy Yes Man (2008). In 2013, he costars with Steve Carell in The Incredible Burt Wonderstone (2013). Carrey has one child with his first wife, Melissa Carrey, whom he divorced in 1995. He married actress Lauren Holly in 1996, but they split less than a year later.",
    "birthPlace": "Newmarket, Ontario, Canada",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Writer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0338013",
      "tt0120382",
      "tt0109040",
      "tt0109686"
    ]
  },
  {
    "name": "Kate Winslet",
    "birthDate": "1975-10-05",
    "picture": "http://ia.media-imdb.com/images/M/MV5BODgzMzM2NTE0Ml5BMl5BanBnXkFtZTcwMTcyMTkyOQ@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000701",
    "miniBio": "Ask Kate Winslet what she liked about any of her characters, and the word \"ballsy\" is bound to pop up at least once. The British actress has made a point of eschewing straightforward pretty-girl parts in favor of more devilish damsels; as a result, she\u0027s built an eclectic resume; that runs the gamut from Shakespearean tragedy to modern-day mysticism and erotica. Winslet was born in Reading, Berkshire, into a family of thespians -- parents Roger Winslet and Sally Anne Bridges-Winslet were both stage actors, maternal grandparents Oliver and Linda Bridges ran the Reading Repertory Theatre, and uncle Robert Bridges was a fixture in London\u0027s West End theatre district. Kate came into her talent at an early age. She scored her first professional gig at 11, dancing opposite the Honey Monster in a commercial for a kids\u0027 cereal. She started acting lessons around the same time, which led to formal training at a performing arts high school. Over the next few years, she appeared on stage regularly and landed a few bit parts in sitcoms. Her first big break came at age 17, when she was cast as an obsessive adolescent in Amizade Sem Limites (1994). The film, based on the true story of two fantasy-gripped girls who commit a brutal murder, received modest distribution but was roundly praised by critics. Still a relative unknown, Winslet attended a cattle call audition the next year for Ang Lee\u0027s Sense and Sensibility (1995). She made an immediate impression on the film\u0027s star, Emma Thompson, and beat out more than a hundred other hopefuls for the part of plucky Marianne Dashwood. Her efforts were rewarded with both a British Academy Award and an Oscar nomination for Best Supporting Actress. Winslet followed up with two more period pieces, playing the rebellious heroine in Jude (1996) and Ophelia in Kenneth Branagh\u0027s Hamlet (1996). The role that transformed Winslet from art house attraction to international star was Rose DeWitt Bukater, the passionate, rosy-cheeked aristocrat in James Cameron\u0027s Titanic (1997). Young girls the world over both idolized and identified with Winslet, swooning over all that face time opposite heartthrob Leonardo DiCaprio and noting her refreshingly healthy, unemaciated physique. Winslet\u0027s performance also garnered a Best Actress nomination, making her the youngest actress to ever receive two Academy Award nominations. After the swell of unexpected attention surrounding Titanic (1997), Winslet was eager to retreat into independent projects. Rumor has it that she turned down the lead roles in both Shakespeare in Love (1998) and Anna and the King (1999) in order to play adventurous soul searchers in Hideous Kinky (1998) and Holy Smoke (1999). The former cast her as a young single mother traveling through 1970s Morocco with her daughters in tow; the latter, as a zealous follower of a guru tricked into a \"deprogramming\" session in the Australian outback. The next year found her back in period dress as the Marquis de Sade\u0027s chambermaid and accomplice in Quills (2000). Kate holds the distinction of being the youngest actor ever honored with four Academy Award nominations (she received her fourth at age 29). Off camera, Winslet is known for her mischievous pranks and familial devotion. She has two sisters, Anna Winslet and Beth Winslet (both actresses), and a brother, Joss. In 1998, she married assistant director Jim Threapleton. They had a daughter, Mia Honey Threapleton, in October 2000. They divorced in 2001. She later married director Sam Mendes in 2003 and gave birth to their son, Joe Alfie Winslet-Mendes, later that year. After seven years of marriage, Kate announced that she and Sam amicably separated in February 2010. She was awarded Commander of the Order of the British Empire in the 2012 Queen\u0027s Birthday Honours List for her accomplishments in film and television.",
    "birthPlace": "Reading, Berkshire, England, UK",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0120338",
      "tt0338013",
      "tt0959337",
      "tt0308644"
    ]
  },
  {
    "name": "Tom Wilkinson",
    "birthDate": "1948-02-05",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTcxNzc0NzQyN15BMl5BanBnXkFtZTcwNjI1NDA2MQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
    "id": "nm0929489",
    "miniBio": "Popular British character actor Tom Wilkinson was born in Leeds, West Yorkshire, England in a long line of urban farmers. He is the son of Marjorie (Percival) and Thomas Wilkinson. Economic hardships forced his family to move to Canada for a few years when Wilkinson was a child; after he had returned to England, he attended and graduated from the University of Kent at Canterbury with a degree in English and American Literature. Wilkinson first became active in film and television in the mid-1970s, but did not become familiar to an international audience until 1997. That was when he starred as one of six unemployed workers who strip for cash in Best Picture nominee The Full Monty (1997), and he went on to win a BAFTA for Best Performance by an Actor in a Supporting Role. That same year, he was featured in Oscar and Lucinda (1997) and Wilde (1997). Wilkinson was also shown to memorable effect as a theatre financier with acting aspirations in Best Picture winner Shakespeare in Love (1998). Over the next few years, Wilkinson would become more popular, especially with American audiences, with such roles as General Cornwallis alongside Mel Gibson in the blockbuster The Patriot (2000) and as the grief-stricken father, Matt Fowler, in the critically acclaimed Best Picture nominee In the Bedroom (2001). For his role in that movie, he received a nomination for Best Actor in a Leading Role. Since then, Wilkinson has made memorable appearances in Eternal Sunshine of the Spotless Mind (2004), Batman Begins (2005), The Exorcism of Emily Rose (2005), Valkyrie (2008), Duplicity (2009), The Ghost (2010), The Debt (2010) and The Best Exotic Marigold Hotel (2011), among others. Wilkinson also received his second Academy Award nomination for his acclaimed role in Michael Clayton (2007). Wilkinson won an Emmy Award for his work as Benjamin Franklin in HBO\u0027s John Adams (2008) mini-series. The same year, he received an Emmy nomination for his role in HBO movie Recount (2008), and has also received Emmy nominations for Normal (2003) and Os Kennedy (2011). Wilkinson has two children, Alice and Molly, with wife Diana Hardcastle.",
    "birthPlace": "Leeds, West Yorkshire, England, UK",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0372784",
      "tt0465538",
      "tt0138097",
      "tt0338013"
    ]
  },
  {
    "name": "Craig T. Nelson",
    "birthDate": "1944-04-04",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTI0ODQwMDU1OV5BMl5BanBnXkFtZTcwMDkxNTE2Mg@@._V1_SY317_CR16,0,214,317_AL_.jpg",
    "id": "nm0005266",
    "miniBio": "Craig T. Nelson was born on April 4, 1944 in Spokane, Washington, USA as Craig Theodore Nelson. He is an actor and producer, known for The Incredibles (2004), Coach (1989) and Poltergeist (1982). He has been married to Doria Cook-Nelson since 1987. He was previously married to Robin Nelson.",
    "birthPlace": "Spokane, Washington, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Director"
    ],
    "knownFor": [
      "tt0317705",
      "tt0096560",
      "tt0084516",
      "tt1041829"
    ]
  },
  {
    "name": "Samuel L. Jackson",
    "birthDate": "1948-12-21",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTQ1NTQwMTYxNl5BMl5BanBnXkFtZTYwMjA1MzY1._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000168",
    "miniBio": "Samuel L. Jackson was born in Washington, D.C., to Elizabeth (Montgomery) and Henry Jackson. He was raised by his mother, a factory worker. Samuel usually played bad guys and drug addicts before becoming an action hero, as the character Mitch Henessey, in The Long Kiss Goodnight (1996) and in Die Hard: With a Vengeance (1995). From character player to leading man. His performance in Pulp Fiction (1994) gave him an Oscar nomination for his character Jules Winnfield. He was active in the black student movement. In the seventies he joined the Negro Ensemble Company (together with Morgan Freeman). In the eighties he became well known by three movies made by Spike Lee - Do the Right Thing (1989), Mo\u0027 Better Blues (1990) and Jungle Fever (1991). He received a Silver Berlin Bear for his part in the movie Jackie Brown (1997) as Ordell Robbi.",
    "birthPlace": "Washington, District of Columbia, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0110912",
      "tt1853728",
      "tt0317705",
      "tt1843866"
    ]
  },
  {
    "name": "Holly Hunter",
    "birthDate": "1958-03-20",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMjIzNzg1ODA1NF5BMl5BanBnXkFtZTcwNTI4NzQ4Mg@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0000456",
    "miniBio": "Holly Hunter was born in Conyers, Georgia, to Opal Marguerite (Catledge), a homemaker, and Charles Edwin Hunter, a part-time sporting goods company representative and farmer with a 250 acre farm. She is the youngest of seven children. Her parents encouraged her talent at an early age, and her first acting part was as Helen Keller in a fifth-grade play. In 1976 she went to Pittsburgh to pursue a degree in drama from Carnegie Mellon University. After graduating in 1980, she went to New York City, where she met playwright Beth Henley in a stalled elevator. Hunter went on to get roles in a number of Henley\u0027s southern gothic plays, including Crimes of the Heart and The Miss Firecracker Contest. In 1982 the actress went to Los Angeles. She landed her first starring role in the movies in the Coen brothers\u0027 Raising Arizona (1987), a part that is said to have been written with her in mind. She gained stardom in 1987 when she played the driven TV news producer Jane Craig in James L. Brooks\u0027 Broadcast News (1987). In 1993 she earned an Academy Award and worldwide acclaim with her performance as a mute bride to a New Zealand planter in O Piano (1993).",
    "birthPlace": "Conyers, Georgia, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actress",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0317705",
      "tt0107822",
      "tt0190590",
      "tt0093822"
    ]
  },
  {
    "name": "Jon Heder",
    "birthDate": "1977-10-26",
    "picture": "http://ia.media-imdb.com/images/M/MV5BNDA0MjY5NTA1OV5BMl5BanBnXkFtZTcwOTk3Mjg4Mw@@._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm1417647",
    "miniBio": "Jon Heder was born on October 26, 1977 in Fort Collins, Colorado, USA as Jonathan Joseph Heder. He is an actor and producer, known for Napoleon Dynamite (2004), Blades of Glory (2007) and Surf\u0027s Up (2007). He has been married to Kirsten Heder since November 23, 2002. They have two children.",
    "birthPlace": "Fort Collins, Colorado, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Soundtrack"
    ],
    "knownFor": [
      "tt0374900",
      "tt0445934",
      "tt0423294",
      "tt0425123"
    ]
  },
  {
    "name": "Efren Ramirez",
    "birthDate": "1973-10-02",
    "picture": "http://ia.media-imdb.com/images/M/MV5BOTgzODU2OTM4MV5BMl5BanBnXkFtZTcwNzE1NDU3OA@@._V1_SY317_CR1,0,214,317_AL_.jpg",
    "id": "nm0708293",
    "miniBio": "A new face to filmgoers, Efren Ramirez is a bona fide scene-stealer in the quirky comedy Napoleon Dynamite (2004). Given a choice between choosing Napoleon Dynamite and The Alamo (2004), Efren was quick to choose \"Napoleon Dynamite\", which has grossed over $41 million at the box office to date. Born in Los Angeles, by age 13 he began training at The Theatre of Arts, and performed at the world-famous Hollywood Bowl, The Complex Theatre and The Tiffany Theatre on Sunset Blvd. while working on films such as Touchstone\u0027s Kazaam (1996). He continued training at The Whole Theatre Comp and performing improv at The Whitefire Theatre and The Icehouse in Pasadena. After finishing up a two-year Meisner conservatory program, he starred in Missing Pieces (1992) (opposite the late James Coburn), The Race (2004) with Cliff Robertson, CCH Pounder and Paul Rodriguez, directed by Tom Musca, and Delivering Milo (2001) with Albert Finney, directed by Nick Castle. Some of his other films are \"Welcome to L.A.\" (2000)_, Night Crew (2000), Swallow (2003), Dance (2000) and Rave (2000). Ramirez\u0027s extensive TV shows include recurring roles on Disney\u0027s Even Stevens (1999) and Fox\u0027s Boston Public (2000), and he has guest-starred on ER (1994), The District (2000) and Judging Amy (1999). He has also appeared on MTV\u0027s All You\u0027ve Got (2006) alongside Ciara, HBO\u0027s Walkout (2006) with Michael Peña and Alexa PenaVega, Super Nacho - O Herói do Wrestling (2006) with Jack Black, Crossing the Heart (2007) with Kris Kristofferson and Crank (2006) with Jason Statham. He also studies at The Gloria Gifford Conservatory for Performing Arts. Collectively his films have grossed over $80 million to date.",
    "birthPlace": "Los Angeles, California, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Producer",
      "Composer"
    ],
    "knownFor": [
      "tt0479884",
      "tt0374900",
      "tt1121931",
      "tt0424993"
    ]
  },
  {
    "name": "Jon Gries",
    "birthDate": "1957-06-17",
    "picture": "http://ia.media-imdb.com/images/M/MV5BMTI1NTkwNjg0NV5BMl5BanBnXkFtZTYwNzg2Njc1._V1_SX214_CR0,0,214,317_AL_.jpg",
    "id": "nm0340973",
    "miniBio": "Jon Gries was born on June 17, 1957 in Glendale, California, USA as Jonathan Francis Gries. He is an actor, known for Busca Implacável (2008), Napoleon Dynamite (2004) and Men in Black (1997).",
    "birthPlace": "Glendale, California, USA",
    "director": true,
    "actor": false,
    "jobCategories": [
      "Actor",
      "Soundtrack",
      "Director"
    ],
    "knownFor": [
      "tt0936501",
      "tt0374900",
      "tt0119654",
      "tt1397280"
    ]
  }
]